Учет_ФК/src/Catalogs/ТранспортныеСредства/ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортныеСредства</name>
  <attributes>
    <name>ТипТранспортногоСредства</name>
    <type>
      <types>EnumRef.ТипыТранспортныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственникТС</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельТС</name>
    <type>
      <types>CatalogRef.МоделиАвтотранспорта</types>
    </type>
  </attributes>
</mdclass:Catalog>

Учет_ФК/src/Enums/ТипыТранспортныхСредств/ТипыТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТранспортныхСредств</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>ЖелезнодорожныйПолувагон</name>
  </enumValues>
</mdclass:Enum>

Учет_ФК/src/Catalogs/ТранспортныеСредства/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТипТранспортногоСредстваПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФОрмой()
	
	ЭтоАвтомобиль = Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.Автомобиль");
	Элементы.МодельТС.Видимость = ЭтоАвтомобиль;
	
	Если Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.Автомобиль") Тогда 
		Элементы.Номер.Заголовок = "Номер автомобиля";
		Элементы.СобственникТС.Заголовок = "Собственник автомобиля";
		
	ИначеЕсли Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.ЖелезнодорожныйПолувагон") Тогда 
		Элементы.Номер.Заголовок = "Номер вагона";
		Элементы.СобственникТС.Заголовок = "Собственник вагона";
	КонецЕсли;
	СформироватьИмяТС();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИмяТС()
	
	Если Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.Автомобиль") Тогда 
		Объект.Наименование = "Автомобиль г/н "+сокрЛП(Объект.НомерТС);
	ИначеЕсли Объект.ТипТранспортногоСредства = ПредопределенноеЗначение("Перечисление.ТипыТранспортныхСредств.ЖелезнодорожныйПолувагон") Тогда 
		Объект.Наименование = "Вагон № "+сокрЛП(Объект.НомерТС);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьИмяТС();
КонецПроцедуры
